''' Хакер Василий получил доступ к классному журналу и хочет заменить все свои минимальные оценки на максимальные. 
Напишите программу, которая заменяет оценки Василия, но наоборот: все максимальные – на минимальные.
Input: 5 -> 1 3 3 3 4
Output: 1 3 3 3 1 '''

a = [1, 3, 3, 3, 4, 4]
min_elem = min(a)
max_elem = max(a)
new_a = []
for elem in a:
    if elem == max_elem:
        new_a.append(min_elem)
    else:
        new_a.append(elem)
print(new_a)