''' Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
*Пример:*
6 -> 1  4  1
24 -> 4  16  4
60 -> 10  40  10 '''

S = int (input('всего журавликов сделали: '))
if S%6==0:
    a = S//3
    b = a//2
    c = a*2
    print ('Петя', b, 'Катя', c, 'Сережа', b)
else:
    print('неверное число')