''' Найдите сумму цифр трехзначного числа.
*Пример:*
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) '''

a = input ('введите трехзначное число: ')
b = int(a[0])
c = int(a[1])
d = int(a[2])
print (b, '+', c, '+', d, '=', b+c+d)
