''' В некоторой школе решили набрать три новых
математических класса и оборудовать кабинеты для
них новыми партами. За каждой партой может сидеть
два учащихся. Известно количество учащихся в
каждом из трех классов. Выведите наименьшее
число парт, которое нужно приобрести для них.
Input: 20 21 22(ввод чисел НЕ в одну строку)
Output: 32'''

a = int(input('учеников в первом классе '))
b = int(input('учеников во втором классе '))
c = int(input('учеников в третьем классе '))
''' sum = a+b+c
t = int (bool(sum/2))
v = sum//2 + t
print('необходимо', v, 'парт') '''
v = ((a//2)+(a%2)+(b//2)+(b%2)+(c//2)+(c%2))
print('необходимо', v, 'парт') 