'''Дан массив, состоящий из целых чисел. Напишите программу, которая в данном массиве определит количество элементов, у которых два соседних и, при
этом, оба соседних элемента меньше данного. Сначала вводится число N — количество элементов в массиве
Далее записаны N чисел — элементы массива. Массив состоит из целых чисел
Ввод 5
1 2 3 4 5
вывод 0
ввод 5
1 5 1 5 1
вывод 2'''

a = [1, 5, 3, 5, 1]
count = 0
for i in range(1, len(a)-1):
    if a[i-1] < a[i] > a[i+1]:
        count += 1
print(count)