''' Два различных натуральных числа n и m называются дружественными, если сумма делителей числа n (включая 1, но исключая само n) равна числу m и наоборот. 
Например, 220 и 284 – дружественные числа. По данному числу k выведите все пары дружественных чисел, каждое из которых не превосходит k. 
Программа получает на вход одно натуральное число k, не превосходящее 105. Программа должна вывести все пары дружественных чисел, каждое из которых не
превосходит k. Пары необходимо выводить по одной в строке, разделяя пробелами. Каждая пара должна быть выведена только один раз (перестановка чисел новую
пару не дает).
ввод 300
вывод 220 284 '''

def sum_del (number):
    summa = 1
    for i in range (2, number // 2 + 1):
        if number % i == 0:
            summa += i
    return summa

k = 300
for i in range (k - 1):
    for j in range (i + 1, k):
        if sum_del(i) == j and sum_del(j) == i:
            print (i, j)