''' На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. Определите минимальное число монеток, 
которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. 
Выведите минимальное количество монет, которые нужно перевернуть '''

coins = int (input('введите количество монет: '))
eagle = tails = 0
for i in range (coins):
    side = int (input ('орёл - 0, решка -1 : '))
    if side == 1:
        tails += 1
    else:
        eagle += 1
if eagle < tails:
    print ('Минимальное количество монет, что нужно перевернуть -', eagle, 'c орла на решку')
elif eagle > tails:
    print ('Минимальное количество монет, что нужно перевернуть -', tails, 'c решки на орёл')
elif eagle == tails:
    print ('Переверните', eagle, 'монет с любой стороной')
