''' Дано натуральное число A > 1. Определите, каким по счету числом Фибоначчи оно является, 
то есть выведите такое число n, что φ(n)=A. Если А не является числом Фибоначчи, выведите число -1.
Input: 5
Output: 6 '''

A = int (input('введите A: '))
index = 3
a, b = 0, 1
while a+b < A:
    index += 1
    a, b = b, a + b

if a + b == A:
    print(index)
else:
    print (-1)