''' Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. 
Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. 
Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.'''

summ = int (input ('сумма чисел: '))
prod = int (input ('произведение чисел: '))
for first in range(summ):
    for second in range (prod):
        if summ == first + second and prod == first * second:
            print('загаданные числа', first, 'и', second)
            exit()
        else:
            print ('неверные числа')
            exit()
